diploma thesis/src/implementation/assets/setCredentials-request.xml

<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:rem="http://remote.bootware.simtech.org/">
	<soapenv:Header/>
	<soapenv:Body>
		<rem:setCredentials>
			<credentialsList>
				<entry>
					<key>AwsCredentials</key>
					<value>
						<credentials>
							<entry>
								<key>secretKey</key>
								<value>874w5zhpswe98tzhg0w87ser049tadsiph</value>
							</entry>
							<entry>
								<key>accessKey</key>
								<value>g9w276og9746gw5</value>
							</entry>
						</credentials>
					</value>
				</entry>
			</credentialsList>
		</rem:setCredentials>
	</soapenv:Body>
</soapenv:Envelope>
